//  Використовуючи if...else напиши код, який буде запитувати у користувача "Яка офіційна назва JavaScript?".
//    Якщо користувач вводить "ECMAScript", то показати за допомогою alert("Вірно!")
//    У інших випадках показати "Не знаєте? ECMAScript!"

// const question = prompt("Яка офіційна назва JavaScript?");
// const answer = "ECMAScript"
// if (answer.toLowerCase() === question.toLowerCase()) {
//   alert("Вірно!")
// } else {
//     alert("Не знаєте? ECMAScript!")
// }


//  Напишіть цикл, який виводить у консоль числа від max до min у порядку зменшення.
// У консоль виведіть усі парні числа від min до max

// const max = 50
// const min = 23
 
// for (let i = max; i >= min; i -= 1) {
//     if (i % 2 === 0) { 
//         console.log(i)
//     }
// }

//Напиши код, який буде запитувати логін за допомогою prompt та логувати результат у консоль браузера.
// Якщо користувач вводить "Адмін", то promt запитує пароль.Якщо нічого не введено або натиснута клавіша Esc,
//     вивести рядок "Відмінено"
//     У іншому випадку вивести рядок "Я вас не знаю!"

// Пароль перевіряти так:
// якщо введено пароль "Я головний", то вивести "Вітаю!",
//     у іншому випадку виводити рядок "Невірний пароль!".


// Напиши функцію, яка на вхід приймає масив та елемент, який потрібно видалити
// виклик фукції повинен повертати нам новий масив без видаленого елелементу.
//


// 9. Дано рядок, який складається із символів.Наприклад, 'abcde'.
//     Перевірте, що першим символом цього рядка є літера 'a'.
//  Якщо це так - вивести "так", у іншому випадку вивести "ні"


function elements (string){
if (string[0] === "a") {
    return "так";
  }
return "ні";
}


console.log(elements('abcde'));
console.log(elements('wbcde'));
